<a href="https://colab.research.google.com/github/parv-39/Aum_Basics/blob/main/Pandas_Aum.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/refs/heads/master/pandas/1_intro/nyc_weather.csv')

a = df['Temperature'].max() #used to find maximum from the dataset
b = df['EST'][df['Events']=='Rain'] #used to display the dates on which it was raining
c = df['Humidity'].mean() #used to find the average 'Humidity'

print(a)
print(b)
print(c)

# print(df)

50
8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object
51.67741935483871

In [ ]:
import pandas as pd


input_file = "https://raw.githubusercontent.com/codebasics/py/refs/heads/master/pandas/1_intro/nyc_weather.csv"
df = pd.read_csv(input_file) #used to access csv file
print(df)

input_file2 = "https://github.com/alexsington/Data-Sets/raw/refs/heads/main/nba_player_data.xlsx"
df2 = pd.read_excel(input_file2) #used to access excel file
print(df2)

details = {
    'Names' : ['Parv','Ayush','Hemang','Priyanshu'],
    'Birth-dates' : ['12/10/2004','10/4/2004',"12/10/2001","18/8/2004"],
    'School' : ['RKC','TGES','SOS','SHAKTI'],
    'Marks' : [71,78,23,92]
}
df3 = pd.DataFrame(details) #used to display data from dictionary
print(df3)

details2 = [
    ['Dev','2/9/2004','Rajkot', 46],
    ['Harshit','1/4/2004','Porbander', 22],
    ['Mustak',"15/10/2004",'Rajula', 56],
    ['Amaan',"10/10/2004",'Rajkot', 67]
]
df4 = pd.DataFrame(details2,columns=["Name","Dates","City","Marks"]) #used to access data from list
print(df4)

In [2]:
import pandas as pd

details = {
    'Names' : ['Parv','Ayush','Hemang','Priyanshu'],
    'Birth-dates' : ['12/10/2004','10/4/2004',"12/10/2001","18/8/2004"],
    'School' : ['RKC','TGES','SOS','SHAKTI'],
    'Marks' : [71,78,23,92]
}

df = pd.DataFrame(details)
# print(df)


print(df.head(2 )) #used to display the data from starting point
print(df.tail(1)) #used to display the data from ending point
print(df.columns) #used to  display column names
print(df.Names) #used to display the values inside 'Names'
print(df['Birth-dates']) #used to display inside 'Birth-dates'
print(df[['Names','Birth-dates']]) #used to display specific rows and columns([[]])
print(df['Marks'].max()) #find the max marks
print(df['Marks'].mean()) #finds the average
print(df[df.Marks>=60]) #returns the details regarding the condition
print(df.Marks>=60) #returns boolean (True or False)


custom_index = pd.RangeIndex(start=0,stop=4,step=1) #for index purpose
fd = pd.DataFrame(details,index = custom_index)
print(fd)

   Names Birth-dates School  Marks
0   Parv  12/10/2004    RKC     71
1  Ayush   10/4/2004   TGES     78
       Names Birth-dates  School  Marks
3  Priyanshu   18/8/2004  SHAKTI     92
Index(['Names', 'Birth-dates', 'School', 'Marks'], dtype='object')
0         Parv
1        Ayush
2       Hemang
3    Priyanshu
Name: Names, dtype: object
0    12/10/2004
1     10/4/2004
2    12/10/2001
3     18/8/2004
Name: Birth-dates, dtype: object
       Names Birth-dates
0       Parv  12/10/2004
1      Ayush   10/4/2004
2     Hemang  12/10/2001
3  Priyanshu   18/8/2004
92
66.0
       Names Birth-dates  School  Marks
0       Parv  12/10/2004     RKC     71
1      Ayush   10/4/2004    TGES     78
3  Priyanshu   18/8/2004  SHAKTI     92
0     True
1     True
2    False
3     True
Name: Marks, dtype: bool
       Names Birth-dates  School  Marks
0       Parv  12/10/2004     RKC     71
1      Ayush   10/4/2004    TGES     78
2     Hemang  12/10/2001     SOS     23
3  Priyanshu   18/8/2004  SHAKTI     92

In [ ]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/codebasics/py/refs/heads/master/pandas/1_intro/nyc_weather.csv")
new_df = df.fillna(0) #used to place "0" to the missing data
print(new_df)

new_df0 = df.fillna(
    {
        'Temperature' : 0,
        'Events' :'no event'
    }
) #used to add the thd data to the missing values
print(new_df0)


new_df1 = df.fillna(method="ffill") #it is used to fill the previous data to next missing data
print(new_df1)
new_df2 = df.fillna(method="ffill",limit = 1) #it is used to fill the previous data to next missing data but the limit is 1
print(new_df2)
new_df3 = df.fillna(method="bfill") #it is used to fill the next day data to previous missing data
print(new_df3)
new_df4 = df.fillna(method="bfill",limit = 1) #it is used to fill the next day data to previous missing data nut the limit is 1
print(new_df4)

# Convert 'EST' column to datetime objects
df['EST'] = pd.to_datetime(df['EST'])

new_df5 = df.interpolate() #It fills in missing values by guessing what they should be, based on the values before and after them.
print(new_df5)
new_df6 = df.interpolate(method="time") #It fills in missing values by guessing what they should be, based on the values before and after them.
print(new_df6)
new_df7 = df.dropna()#used to remove the entire data entry if it contains atleast one missing value
print(new_df7)
new_df8 = df.dropna(how="all")#used to remove the entire data entry if it contains all missing value
print(new_df8)
new_df9 = df.dropna(thresh=1)#used to remove the entire data entry if it contains atleast one missing value
print(new_df9)

          EST  Temperature  DewPoint  Humidity  Sea Level PressureIn  \
0    1/1/2016           38        23        52                 30.03
1    1/2/2016           36        18        46                 30.02
2    1/3/2016           40        21        47                 29.86
3    1/4/2016           25         9        44                 30.05
4    1/5/2016           20        -3        41                 30.57
5    1/6/2016           33         4        35                 30.50
6    1/7/2016           39        11        33                 30.28
7    1/8/2016           39        29        64                 30.20
8    1/9/2016           44        38        77                 30.16
9   1/10/2016           50        46        71                 29.59
10  1/11/2016           33         8        37                 29.92
11  1/12/2016           35        15        53                 29.85
12  1/13/2016           26         4        42                 29.94
13  1/14/2016           30        12        47                 29.95
14  1/15/2016           43        31        62                 29.82
15  1/16/2016           47        37        70                 29.52
16  1/17/2016           36        23        66                 29.78
17  1/18/2016           25         6        53                 29.83
18  1/19/2016           22         3        42                 30.03
19  1/20/2016           32        15        49                 30.13
20  1/21/2016           31        11        45                 30.15
21  1/22/2016           26         6        41                 30.21
22  1/23/2016           26        21        78                 29.77
23  1/24/2016           28        11        53                 29.92
24  1/25/2016           34        18        54                 30.25
25  1/26/2016           43        29        56                 30.03
26  1/27/2016           41        22        45                 30.03
27  1/28/2016           37        20        51                 29.90
28  1/29/2016           36        21        50                 29.58
29  1/30/2016           34        16        46                 30.01
30  1/31/2016           46        28        52                 29.90

    VisibilityMiles  WindSpeedMPH PrecipitationIn  CloudCover    Events  \
0                10           8.0               0           5       NaN
1                10           7.0               0           3       NaN
2                10           8.0               0           1       NaN
3                10           9.0               0           3       NaN
4                10           5.0               0           0       NaN
5                10           4.0               0           0       NaN
6                10           2.0               0           3       NaN
7                10           4.0               0           8       NaN
8                 9           8.0               T           8      Rain
9                 4           NaN             1.8           7      Rain
10               10           NaN               0           1       NaN
11               10           6.0               T           4       NaN
12               10          10.0               0           0       NaN
13               10           5.0               T           7       NaN
14                9           5.0               T           2       NaN
15                8           7.0            0.24           7      Rain
16                8           6.0            0.05           6  Fog-Snow
17                9          12.0               T           2      Snow
18               10          11.0               0           1       NaN
19               10           6.0               0           2       NaN
20               10           6.0               0           1       NaN
21                9           NaN            0.01           3      Snow
22                1          16.0            2.31           8  Fog-Snow
23                8           6.0               T           3      Snow
24               10           3.0               0           2       NaN
25               10           7.0               0           2       NaN
26               10           7.0               T           3      Rain
27               10           5.0               0           1       NaN
28               10           8.0               0           4       NaN
29               10           7.0               0           0       NaN
30               10           5.0               0           0       NaN

    WindDirDegrees
0              281
1              275
2              277
3              345
4              333
5              259
6              293
7               79
8               76
9              109
10             289
11             235
12             284
13             266
14             101
15             340
16             345
17             293
18             293
19             302
20             312
21              34
22              42
23             327
24             286
25             244
26             311
27             234
28             298
29             257
30             241

In [ ]:
import pandas as pd

df = pd.read_excel("https://github.com/alexsington/Data-Sets/raw/refs/heads/main/nba_player_data.xlsx","Sheet1")
print(df)



df_stocks = pd.DataFrame({
    'tickers' : ['GOOGL','WMT','MSFT'],
    'price' : [845,65,64],
    'pe' : [30.37,14.26,30.97],
    'eps' : [27.82,4.61,2.12]
})

df_weather = pd.DataFrame({
    'day' : ['1/1/2017','1/2/2027','1/2/2017'],
    'temperature' : [32,35,28],
    'event' : ['Rain','Sunny','Snow']
})

with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer,sheet_name="stocks") #it is used to create an individual sheet in excel
    df_weather.to_excel(writer,sheet_name="weather") #it is used to create an individual sheet in excel

         Year       Season_type  PLAYER_ID  RANK           PLAYER TEAM  GP  \
0     2012-13  Regular%20Season     201142     1     Kevin Durant  OKC  81
1     2012-13  Regular%20Season        977     2      Kobe Bryant  LAL  78
2     2012-13  Regular%20Season       2544     3     LeBron James  MIA  76
3     2012-13  Regular%20Season     201935     4     James Harden  HOU  78
4     2012-13  Regular%20Season       2546     5  Carmelo Anthony  NYK  67
...       ...               ...        ...   ...              ...  ...  ..
7288  2021-22          Playoffs    1629006   206      Josh Okogie  MIN   1
7289  2021-22          Playoffs    1630556   206  Kessler Edwards  BKN   2
7290  2021-22          Playoffs    1630201   206    Malachi Flynn  TOR   6
7291  2021-22          Playoffs     202693   206  Markieff Morris  MIA   2
7292  2021-22          Playoffs     200794   206     Paul Millsap  PHI   1

       MIN  FGM   FGA  ...  REB  AST  STL  BLK  TOV   PF   PTS   EFF  AST_TOV  \
0     3119  731  1433  ...  640  374  116  105  280  143  2280  2462     1.34
1     3013  738  1595  ...  433  469  106   25  287  173  2133  1921     1.63
2     2877  765  1354  ...  610  551  129   67  226  110  2036  2446     2.44
3     2985  585  1337  ...  379  455  142   38  295  178  2023  1872     1.54
4     2482  669  1489  ...  460  171   52   32  175  205  1920  1553     0.98
...    ...  ...   ...  ...  ...  ...  ...  ...  ...  ...   ...   ...      ...
7288     2    0     0  ...    0    0    0    0    0    0     0     0     0.00
7289     7    0     0  ...    0    1    1    0    1    3     0     1     1.00
7290    36    0     7  ...    3    3    1    0    1    6     0    -1     3.00
7291     3    0     1  ...    1    0    0    0    1    2     0    -1     0.00
7292     6    0     0  ...    1    1    0    0    0    1     0     2     0.00

      STL_TOV
0        0.41
1        0.37
2        0.57
3        0.48
4        0.30
...       ...
7288     0.00
7289     1.00
7290     1.00
7291     0.00
7292     0.00

[7293 rows x 29 columns]

In [ ]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/codebasics/py/refs/heads/master/pandas/1_intro/nyc_weather.csv")
df.fillna("NaN",inplace = True) #used to add "NaN" to missing values
# df = pd.read_csv("C:/extra/random/Pandas/nyc_weather.csv",nrows=3) #used to print data atmost to 3
# df.to_csv("my_new2.csv",index = False) #used to create new csv file
print(df.columns ) #used to display all the columns of the dataset
df.to_csv("3_columns.csv",columns = ['EST','Temperature','Events']) #used to create new csv file and add data of the particular columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

/tmp/ipython-input-131508936.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'NaN' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna("NaN",inplace = True) #used to add "NaN" to missing values

In [ ]:
import pandas as pd
import numpy as np

details = {
    'Names' : ['Parv','Ayush','Hemang','Priyanshu','Bhargav'],
    'Birth-dates' : ['12/10/2004','10/4/2004',"12/10/2001","18/8/2004","23/2/2005"],
    'School' : ['RKC','TGES','SOS','SHAKTI',"New Parimal"],
    'Marks' : [71,"78F","23F","91F",99]
}

df = pd.DataFrame(details)
# print(df)

# new_df = df.replace(0,np.nan) #used to replace the value
# print(new_df)

new_df2 = df.replace({ #used to replace particular element with data
     99 : 15,
    'New Parimal' : 'New Parimal School'
})
print(new_df2)

new_df3 = df.replace({ #used to remove certain part of the value and and of specified amount
    'Marks': '[A-Za-z]'
},'',regex = True)

print(new_df3)

       Names Birth-dates              School Marks
0       Parv  12/10/2004                 RKC    71
1      Ayush   10/4/2004                TGES   78F
2     Hemang  12/10/2001                 SOS   23F
3  Priyanshu   18/8/2004              SHAKTI   91F
4    Bhargav   23/2/2005  New Parimal School    15
       Names Birth-dates       School Marks
0       Parv  12/10/2004          RKC    71
1      Ayush   10/4/2004         TGES    78
2     Hemang  12/10/2001          SOS    23
3  Priyanshu   18/8/2004       SHAKTI    91
4    Bhargav   23/2/2005  New Parimal    99

In [ ]:
import pandas as pd
import numpy as np

details = {
    'Names' : ['Parv','Ayush','Hemang','Priyanshu','Bhargav'],
    'Birth-dates' : ['12/10/2004','10/4/2004',"12/10/2001","18/8/2004","23/2/2005"],
    'School' : ['RKC','TGES','SOS','SHAKTI',"New Parimal"],
    'Marks' : [71,"78F","23F","91F",99],
    'City' : ['Rajkot','Mumbai','Rajkot','Ahmedabad','Ahmedabad']
}

df = pd.DataFrame(details)
# print(df)

g = df.groupby('City') #used to group data by city
# print(g)
for city,city_df in g: #used to display the city and city_df
    print(city)
    print(city_df)

g.get_group('Mumbai')
# g.discribe() #used to print all the math operations(mean,max,min,std,etc...)
# print(g)

Ahmedabad
       Names Birth-dates       School Marks       City
3  Priyanshu   18/8/2004       SHAKTI   91F  Ahmedabad
4    Bhargav   23/2/2005  New Parimal    99  Ahmedabad
Mumbai
   Names Birth-dates School Marks    City
1  Ayush   10/4/2004   TGES   78F  Mumbai
Rajkot
    Names Birth-dates School Marks    City
0    Parv  12/10/2004    RKC    71  Rajkot
2  Hemang  12/10/2001    SOS   23F  Rajkot

   Names Birth-dates School Marks    City
1  Ayush   10/4/2004   TGES   78F  Mumbai

In [ ]:
import pandas as pd

details1 = {
    'Names' : ['Parv','Ayush','Hemang','Priyanshu','Bhargav'],
    'Birth-dates' : ['12/10/2004','10/4/2004',"12/10/2001","18/8/2004","23/2/2005"],
    'School' : ['RKC','TGES','SOS','SHAKTI',"New Parimal"],
    'Marks' : [71,78,23,9,99],
    'City' : ['Rajkot','Mumbai','Rajkot','Ahmedabad','Ahmedabad']
}

details2 = {
    'Names' : ['Purva','Ayushi','Hemangi','Priyanshi','Shuchi'],
    'Birth-dates' : ['2/11/2004','1/6/2003',"12/1/2001","18/9/2008","23/2/2005"],
    'School' : ['Rk','SNK','KY','SHAKTI',"New Parimal"],
    'Marks' : [71,89,56,55,100],
    'City' : ['Rajkot','Mumbai','Rajkot','Ahmedabad','Ahmedabad']
}

df1 = pd.DataFrame(details1)
df2 = pd.DataFrame(details2)

# df3 = pd.merge(df1,df2,on = "Names",how = "outer") #used to merge to dataset together ("outer = Union" and "inner = Intersection[default]",right,left)
# df4 = pd.merge(df1,df2,on = "Names",how = "outer",indicator = True) #display the data that it caame form which dataset(left or right)
# print(df3)
# print(df4)

df5 = pd.merge(df1,df2,on = "Names",how = "outer",suffixes = ("_left","_right")) #suffixes indicates the name of both the name of dataset
print(df5)

       Names Birth-dates_left  School_left  Marks_left  City_left  \
0      Ayush        10/4/2004         TGES        78.0     Mumbai
1     Ayushi              NaN          NaN         NaN        NaN
2    Bhargav        23/2/2005  New Parimal        99.0  Ahmedabad
3     Hemang       12/10/2001          SOS        23.0     Rajkot
4    Hemangi              NaN          NaN         NaN        NaN
5       Parv       12/10/2004          RKC        71.0     Rajkot
6  Priyanshi              NaN          NaN         NaN        NaN
7  Priyanshu        18/8/2004       SHAKTI         9.0  Ahmedabad
8      Purva              NaN          NaN         NaN        NaN
9     Shuchi              NaN          NaN         NaN        NaN

  Birth-dates_right School_right  Marks_right City_right
0               NaN          NaN          NaN        NaN
1          1/6/2003          SNK         89.0     Mumbai
2               NaN          NaN          NaN        NaN
3               NaN          NaN          NaN        NaN
4         12/1/2001           KY         56.0     Rajkot
5               NaN          NaN          NaN        NaN
6         18/9/2008       SHAKTI         55.0  Ahmedabad
7               NaN          NaN          NaN        NaN
8         2/11/2004           Rk         71.0     Rajkot
9         23/2/2005  New Parimal        100.0  Ahmedabad